/* automatically generated by rust-bindgen 0.66.1 */

pub const REDISMODULE_OK: isize = 0;
pub const REDISMODULE_ERR: isize = 1;
pub const REDISMODULE_AUTH_HANDLED: u32 = 0;
pub const REDISMODULE_AUTH_NOT_HANDLED: u32 = 1;
pub const REDISMODULE_APIVER_1: u32 = 1;
pub const REDISMODULE_TYPE_METHOD_VERSION: u32 = 5;
pub const REDISMODULE_READ: u32 = 1;
pub const REDISMODULE_WRITE: u32 = 2;
pub const REDISMODULE_OPEN_KEY_NOTOUCH: u32 = 65536;
pub const REDISMODULE_OPEN_KEY_NONOTIFY: u32 = 131072;
pub const REDISMODULE_OPEN_KEY_NOSTATS: u32 = 262144;
pub const REDISMODULE_OPEN_KEY_NOEXPIRE: u32 = 524288;
pub const REDISMODULE_OPEN_KEY_NOEFFECTS: u32 = 1048576;
pub const REDISMODULE_LIST_HEAD: isize = 0;
pub const REDISMODULE_LIST_TAIL: isize = 1;
pub const REDISMODULE_KEYTYPE_EMPTY: isize = 0;
pub const REDISMODULE_KEYTYPE_STRING: isize = 1;
pub const REDISMODULE_KEYTYPE_LIST: isize = 2;
pub const REDISMODULE_KEYTYPE_HASH: isize = 3;
pub const REDISMODULE_KEYTYPE_SET: isize = 4;
pub const REDISMODULE_KEYTYPE_ZSET: isize = 5;
pub const REDISMODULE_KEYTYPE_MODULE: isize = 6;
pub const REDISMODULE_KEYTYPE_STREAM: isize = 7;
pub const REDISMODULE_REPLY_UNKNOWN: isize = -1;
pub const REDISMODULE_REPLY_STRING: isize = 0;
pub const REDISMODULE_REPLY_ERROR: isize = 1;
pub const REDISMODULE_REPLY_INTEGER: isize = 2;
pub const REDISMODULE_REPLY_ARRAY: isize = 3;
pub const REDISMODULE_REPLY_NULL: isize = 4;
pub const REDISMODULE_REPLY_MAP: isize = 5;

pub const REDISMODULE_SUBEVENT_MASTER_LINK_DOWN: u64 = 1;
pub const REDISMODULE_SUBEVENT_REPLICA_CHANGE_ONLINE: u64 = 0;
pub const REDISMODULE_SUBEVENT_REPLICA_CHANGE_OFFLINE: u64 = 1;
pub const REDISMODULE_EVENT_REPLROLECHANGED_NOW_MASTER: u64 = 0;
pub const REDISMODULE_EVENT_REPLROLECHANGED_NOW_REPLICA: u64 = 1;
pub const REDISMODULE_SUBEVENT_FLUSHDB_START: u64 = 0;
pub const REDISMODULE_SUBEVENT_FLUSHDB_END: u64 = 1;
pub const REDISMODULE_SUBEVENT_MODULE_LOADED: u64 = 0;
pub const REDISMODULE_SUBEVENT_MODULE_UNLOADED: u64 = 1;
pub const REDISMODULE_SUBEVENT_CONFIG_CHANGE: u64 = 0;
pub const REDISMODULE_SUBEVENT_LOADING_PROGRESS_RDB: u64 = 0;
pub const REDISMODULE_SUBEVENT_LOADING_PROGRESS_AOF: u64 = 1;
pub const REDISMODULE_SUBEVENT_REPL_BACKUP_CREATE: u64 = 0;
pub const REDISMODULE_SUBEVENT_REPL_BACKUP_RESTORE: u64 = 1;
pub const REDISMODULE_SUBEVENT_REPL_BACKUP_DISCARD: u64 = 2;
pub const REDISMODULE_SUBEVENT_REPL_ASYNC_LOAD_STARTED: u64 = 0;
pub const REDISMODULE_SUBEVENT_REPL_ASYNC_LOAD_ABORTED: u64 = 1;
pub const REDISMODULE_SUBEVENT_REPL_ASYNC_LOAD_COMPLETED: u64 = 2;
pub const REDISMODULE_SUBEVENT_FORK_CHILD_BORN: u64 = 0;
pub const REDISMODULE_SUBEVENT_FORK_CHILD_DIED: u64 = 1;
pub const REDISMODULE_SUBEVENT_EVENTLOOP_BEFORE_SLEEP: u64 = 0;
pub const REDISMODULE_SUBEVENT_EVENTLOOP_AFTER_SLEEP: u64 = 1;
pub const REDISMODULE_SUBEVENT_KEY_DELETED: u64 = 0;
pub const REDISMODULE_SUBEVENT_KEY_EXPIRED: u64 = 1;
pub const REDISMODULE_SUBEVENT_KEY_EVICTED: u64 = 2;
pub const REDISMODULE_SUBEVENT_KEY_OVERWRITTEN: u64 = 3;
pub const REDISMODULE_CLIENTINFO_FLAG_SSL: u32 = 1;
pub const REDISMODULE_CLIENTINFO_FLAG_PUBSUB: u32 = 2;
pub const REDISMODULE_CLIENTINFO_FLAG_BLOCKED: u32 = 4;
pub const REDISMODULE_CLIENTINFO_FLAG_TRACKING: u32 = 8;
pub const REDISMODULE_CLIENTINFO_FLAG_UNIXSOCKET: u32 = 16;
pub const REDISMODULE_CLIENTINFO_FLAG_MULTI: u32 = 32;
pub const REDISMODULE_CLIENTINFO_VERSION: u32 = 1;
pub const REDISMODULE_REPLICATIONINFO_VERSION: u32 = 1;
pub const REDISMODULE_FLUSHINFO_VERSION: u32 = 1;
pub const REDISMODULE_MODULE_CHANGE_VERSION: u32 = 1;
pub const REDISMODULE_CONFIGCHANGE_VERSION: u32 = 1;
pub const REDISMODULE_CRON_LOOP_VERSION: u32 = 1;
pub const REDISMODULE_LOADING_PROGRESS_VERSION: u32 = 1;
pub const REDISMODULE_SWAPDBINFO_VERSION: u32 = 1;
pub const REDISMODULE_KEYINFO_VERSION: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleString {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKey {
    _unused: [u8; 0],
}
pub type mstime_t = ::std::os::raw::c_longlong;
pub type ustime_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleStreamID {
    pub ms: u64,
    pub seq: u64,
}
#[test]
fn bindgen_test_layout_RedisModuleStreamID() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleStreamID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleStreamID>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleStreamID))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleStreamID>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleStreamID))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleStreamID),
            "::",
            stringify!(ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleStreamID),
            "::",
            stringify!(seq)
        )
    );
}
pub type RedisModuleTimerID = u64;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_STRING: RedisModuleCommandArgType = 0;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_INTEGER: RedisModuleCommandArgType = 1;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_DOUBLE: RedisModuleCommandArgType = 2;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_KEY: RedisModuleCommandArgType = 3;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_PATTERN: RedisModuleCommandArgType = 4;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_UNIX_TIME: RedisModuleCommandArgType = 5;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_PURE_TOKEN: RedisModuleCommandArgType = 6;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_ONEOF: RedisModuleCommandArgType = 7;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_BLOCK: RedisModuleCommandArgType = 8;
pub type RedisModuleCommandArgType = ::std::os::raw::c_uint;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_INVALID:
    RedisModuleKeySpecBeginSearchType = 0;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_UNKNOWN:
    RedisModuleKeySpecBeginSearchType = 1;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_INDEX:
    RedisModuleKeySpecBeginSearchType = 2;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_KEYWORD:
    RedisModuleKeySpecBeginSearchType = 3;
pub type RedisModuleKeySpecBeginSearchType = ::std::os::raw::c_uint;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_OMITTED:
    RedisModuleKeySpecFindKeysType = 0;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_UNKNOWN:
    RedisModuleKeySpecFindKeysType = 1;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_RANGE:
    RedisModuleKeySpecFindKeysType = 2;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_KEYNUM:
    RedisModuleKeySpecFindKeysType = 3;
pub type RedisModuleKeySpecFindKeysType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandArg {
    pub name: *const ::std::os::raw::c_char,
    pub type_: RedisModuleCommandArgType,
    pub key_spec_index: ::std::os::raw::c_int,
    pub token: *const ::std::os::raw::c_char,
    pub summary: *const ::std::os::raw::c_char,
    pub since: *const ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_int,
    pub deprecated_since: *const ::std::os::raw::c_char,
    pub subargs: *mut RedisModuleCommandArg,
    pub display_text: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandArg() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandArg> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandArg>(),
        72usize,
        concat!("Size of: ", stringify!(RedisModuleCommandArg))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandArg>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCommandArg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_spec_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(key_spec_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).summary) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(summary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).since) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(since)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deprecated_since) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(deprecated_since)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subargs) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(subargs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).display_text) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandArg),
            "::",
            stringify!(display_text)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandHistoryEntry {
    pub since: *const ::std::os::raw::c_char,
    pub changes: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandHistoryEntry() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandHistoryEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandHistoryEntry>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleCommandHistoryEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandHistoryEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCommandHistoryEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).since) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandHistoryEntry),
            "::",
            stringify!(since)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).changes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandHistoryEntry),
            "::",
            stringify!(changes)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RedisModuleCommandKeySpec {
    pub notes: *const ::std::os::raw::c_char,
    pub flags: u64,
    pub begin_search_type: RedisModuleKeySpecBeginSearchType,
    pub bs: RedisModuleCommandKeySpec__bindgen_ty_1,
    pub find_keys_type: RedisModuleKeySpecFindKeysType,
    pub fk: RedisModuleCommandKeySpec__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union RedisModuleCommandKeySpec__bindgen_ty_1 {
    pub index: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1,
    pub keyword: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1 {
    pub pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pos)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2 {
    pub keyword: *const ::std::os::raw::c_char,
    pub startfrom: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyword) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(keyword)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startfrom) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(startfrom)
        )
    );
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyword) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_1),
            "::",
            stringify!(keyword)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union RedisModuleCommandKeySpec__bindgen_ty_2 {
    pub range: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1,
    pub keynum: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1 {
    pub lastkey: ::std::os::raw::c_int,
    pub keystep: ::std::os::raw::c_int,
    pub limit: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(lastkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keystep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(keystep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(limit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2 {
    pub keynumidx: ::std::os::raw::c_int,
    pub firstkey: ::std::os::raw::c_int,
    pub keystep: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keynumidx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(keynumidx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firstkey) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(firstkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keystep) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(keystep)
        )
    );
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_2>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keynum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec__bindgen_ty_2),
            "::",
            stringify!(keynum)
        )
    );
}
#[test]
fn bindgen_test_layout_RedisModuleCommandKeySpec() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandKeySpec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandKeySpec>(),
        56usize,
        concat!("Size of: ", stringify!(RedisModuleCommandKeySpec))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandKeySpec>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCommandKeySpec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec),
            "::",
            stringify!(notes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).begin_search_type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec),
            "::",
            stringify!(begin_search_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec),
            "::",
            stringify!(bs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_keys_type) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec),
            "::",
            stringify!(find_keys_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fk) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandKeySpec),
            "::",
            stringify!(fk)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandInfoVersion {
    pub version: ::std::os::raw::c_int,
    pub sizeof_historyentry: usize,
    pub sizeof_keyspec: usize,
    pub sizeof_arg: usize,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandInfoVersion() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandInfoVersion> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandInfoVersion>(),
        32usize,
        concat!("Size of: ", stringify!(RedisModuleCommandInfoVersion))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandInfoVersion>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCommandInfoVersion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfoVersion),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeof_historyentry) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfoVersion),
            "::",
            stringify!(sizeof_historyentry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeof_keyspec) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfoVersion),
            "::",
            stringify!(sizeof_keyspec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeof_arg) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfoVersion),
            "::",
            stringify!(sizeof_arg)
        )
    );
}
extern "C" {
    pub static RedisModule_CurrentCommandInfoVersion: RedisModuleCommandInfoVersion;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandInfo {
    pub version: *const RedisModuleCommandInfoVersion,
    pub summary: *const ::std::os::raw::c_char,
    pub complexity: *const ::std::os::raw::c_char,
    pub since: *const ::std::os::raw::c_char,
    pub history: *mut RedisModuleCommandHistoryEntry,
    pub tips: *const ::std::os::raw::c_char,
    pub arity: ::std::os::raw::c_int,
    pub key_specs: *mut RedisModuleCommandKeySpec,
    pub args: *mut RedisModuleCommandArg,
}
#[test]
fn bindgen_test_layout_RedisModuleCommandInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCommandInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCommandInfo>(),
        72usize,
        concat!("Size of: ", stringify!(RedisModuleCommandInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCommandInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCommandInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).summary) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(summary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).complexity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(complexity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).since) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(since)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).history) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(history)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tips) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(tips)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arity) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(arity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_specs) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(key_specs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).args) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCommandInfo),
            "::",
            stringify!(args)
        )
    );
}
pub type RedisModuleEventLoopFunc = ::std::option::Option<
    unsafe extern "C" fn(
        fd: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
        mask: ::std::os::raw::c_int,
    ),
>;
pub type RedisModuleEventLoopOneShotFunc =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleEvent {
    pub id: u64,
    pub dataver: u64,
}
#[test]
fn bindgen_test_layout_RedisModuleEvent() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleEvent>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleEvent),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataver) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleEvent),
            "::",
            stringify!(dataver)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDefragCtx {
    _unused: [u8; 0],
}
pub type RedisModuleEventCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        eid: RedisModuleEvent,
        subevent: u64,
        data: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub static RedisModuleEvent_ReplicationRoleChanged: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Persistence: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_FlushDB: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Loading: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ClientChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Shutdown: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ReplicaChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_CronLoop: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_MasterLinkChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ModuleChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_LoadingProgress: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_SwapDB: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ReplBackup: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ReplAsyncLoad: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ForkChild: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_EventLoop: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Config: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Key: RedisModuleEvent;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClientInfo {
    pub version: u64,
    pub flags: u64,
    pub id: u64,
    pub addr: [::std::os::raw::c_char; 46usize],
    pub port: u16,
    pub db: u16,
}
#[test]
fn bindgen_test_layout_RedisModuleClientInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleClientInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleClientInfo>(),
        80usize,
        concat!("Size of: ", stringify!(RedisModuleClientInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleClientInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleClientInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).db) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(db)
        )
    );
}
pub type RedisModuleClientInfoV1 = RedisModuleClientInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleReplicationInfo {
    pub version: u64,
    pub master: ::std::os::raw::c_int,
    pub masterhost: *mut ::std::os::raw::c_char,
    pub masterport: ::std::os::raw::c_int,
    pub replid1: *mut ::std::os::raw::c_char,
    pub replid2: *mut ::std::os::raw::c_char,
    pub repl1_offset: u64,
    pub repl2_offset: u64,
}
#[test]
fn bindgen_test_layout_RedisModuleReplicationInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleReplicationInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleReplicationInfo>(),
        64usize,
        concat!("Size of: ", stringify!(RedisModuleReplicationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleReplicationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleReplicationInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).master) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).masterhost) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(masterhost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).masterport) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(masterport)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).replid1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(replid1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).replid2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(replid2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).repl1_offset) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(repl1_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).repl2_offset) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(repl2_offset)
        )
    );
}
pub type RedisModuleReplicationInfoV1 = RedisModuleReplicationInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleFlushInfo {
    pub version: u64,
    pub sync: i32,
    pub dbnum: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleFlushInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleFlushInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleFlushInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleFlushInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleFlushInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleFlushInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleFlushInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleFlushInfo),
            "::",
            stringify!(sync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbnum) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleFlushInfo),
            "::",
            stringify!(dbnum)
        )
    );
}
pub type RedisModuleFlushInfoV1 = RedisModuleFlushInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleModuleChange {
    pub version: u64,
    pub module_name: *const ::std::os::raw::c_char,
    pub module_version: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleModuleChange() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleModuleChange> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleModuleChange>(),
        24usize,
        concat!("Size of: ", stringify!(RedisModuleModuleChange))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleModuleChange>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleModuleChange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleModuleChange),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).module_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleModuleChange),
            "::",
            stringify!(module_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).module_version) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleModuleChange),
            "::",
            stringify!(module_version)
        )
    );
}
pub type RedisModuleModuleChangeV1 = RedisModuleModuleChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleConfigChange {
    pub version: u64,
    pub num_changes: u32,
    pub config_names: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_RedisModuleConfigChange() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleConfigChange> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleConfigChange>(),
        24usize,
        concat!("Size of: ", stringify!(RedisModuleConfigChange))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleConfigChange>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleConfigChange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleConfigChange),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_changes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleConfigChange),
            "::",
            stringify!(num_changes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config_names) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleConfigChange),
            "::",
            stringify!(config_names)
        )
    );
}
pub type RedisModuleConfigChangeV1 = RedisModuleConfigChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCronLoopInfo {
    pub version: u64,
    pub hz: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleCronLoopInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleCronLoopInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCronLoopInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleCronLoopInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCronLoopInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCronLoopInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCronLoopInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCronLoopInfo),
            "::",
            stringify!(hz)
        )
    );
}
pub type RedisModuleCronLoopV1 = RedisModuleCronLoopInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleLoadingProgressInfo {
    pub version: u64,
    pub hz: i32,
    pub progress: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleLoadingProgressInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleLoadingProgressInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleLoadingProgressInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleLoadingProgressInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleLoadingProgressInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleLoadingProgressInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleLoadingProgressInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleLoadingProgressInfo),
            "::",
            stringify!(hz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).progress) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleLoadingProgressInfo),
            "::",
            stringify!(progress)
        )
    );
}
pub type RedisModuleLoadingProgressV1 = RedisModuleLoadingProgressInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleSwapDbInfo {
    pub version: u64,
    pub dbnum_first: i32,
    pub dbnum_second: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleSwapDbInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleSwapDbInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleSwapDbInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleSwapDbInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleSwapDbInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleSwapDbInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleSwapDbInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbnum_first) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleSwapDbInfo),
            "::",
            stringify!(dbnum_first)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbnum_second) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleSwapDbInfo),
            "::",
            stringify!(dbnum_second)
        )
    );
}
pub type RedisModuleSwapDbInfoV1 = RedisModuleSwapDbInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKeyInfo {
    pub version: u64,
    pub key: *mut RedisModuleKey,
}
#[test]
fn bindgen_test_layout_RedisModuleKeyInfo() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleKeyInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleKeyInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleKeyInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleKeyInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleKeyInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleKeyInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleKeyInfo),
            "::",
            stringify!(key)
        )
    );
}
pub type RedisModuleKeyInfoV1 = RedisModuleKeyInfo;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_AUTH: RedisModuleACLLogEntryReason = 0;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_CMD: RedisModuleACLLogEntryReason = 1;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_KEY: RedisModuleACLLogEntryReason = 2;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_CHANNEL: RedisModuleACLLogEntryReason =
    3;
pub type RedisModuleACLLogEntryReason = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleIO {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDigest {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleInfoCtx {
    _unused: [u8; 0],
}
pub type RedisModuleInfoFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleInfoCtx, for_crash_report: ::std::os::raw::c_int),
>;
pub type RedisModuleDefragFunc =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx)>;
pub type RedisModuleUserChangedFunc = ::std::option::Option<
    unsafe extern "C" fn(client_id: u64, privdata: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommand {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCallReply {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleBlockedClient {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClusterInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDict {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDictIter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandFilterCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandFilter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleServerInfoData {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleScanCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleUser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKeyOptCtx {
    _unused: [u8; 0],
}
pub type RedisModuleCmdFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleDisconnectFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, bc: *mut RedisModuleBlockedClient),
>;
pub type RedisModuleNotificationFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        type_: ::std::os::raw::c_int,
        event: *const ::std::os::raw::c_char,
        key: *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModulePostNotificationJobFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, pd: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        encver: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(rdb: *mut RedisModuleIO, value: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeAuxLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        encver: ::std::os::raw::c_int,
        when: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleTypeAuxSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(rdb: *mut RedisModuleIO, when: ::std::os::raw::c_int),
>;
pub type RedisModuleTypeRewriteFunc = ::std::option::Option<
    unsafe extern "C" fn(
        aof: *mut RedisModuleIO,
        key: *mut RedisModuleString,
        value: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleTypeMemUsageFunc =
    ::std::option::Option<unsafe extern "C" fn(value: *const ::std::os::raw::c_void) -> usize>;
pub type RedisModuleTypeMemUsageFunc2 = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleKeyOptCtx,
        value: *const ::std::os::raw::c_void,
        sample_size: usize,
    ) -> usize,
>;
pub type RedisModuleTypeDigestFunc = ::std::option::Option<
    unsafe extern "C" fn(digest: *mut RedisModuleDigest, value: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeFreeFunc =
    ::std::option::Option<unsafe extern "C" fn(value: *mut ::std::os::raw::c_void)>;
pub type RedisModuleTypeFreeEffortFunc = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut RedisModuleString,
        value: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type RedisModuleTypeFreeEffortFunc2 = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleKeyOptCtx,
        value: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type RedisModuleTypeUnlinkFunc = ::std::option::Option<
    unsafe extern "C" fn(key: *mut RedisModuleString, value: *const ::std::os::raw::c_void),
>;
pub type RedisModuleTypeUnlinkFunc2 = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, value: *const ::std::os::raw::c_void),
>;
pub type RedisModuleTypeCopyFunc = ::std::option::Option<
    unsafe extern "C" fn(
        fromkey: *mut RedisModuleString,
        tokey: *mut RedisModuleString,
        value: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeCopyFunc2 = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleKeyOptCtx,
        value: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeDefragFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleDefragCtx,
        key: *mut RedisModuleString,
        value: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleClusterMessageReceiver = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        sender_id: *const ::std::os::raw::c_char,
        type_: u8,
        payload: *const ::std::os::raw::c_uchar,
        len: u32,
    ),
>;
pub type RedisModuleTimerProc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, data: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleCommandFilterFunc =
    ::std::option::Option<unsafe extern "C" fn(filter: *mut RedisModuleCommandFilterCtx)>;
pub type RedisModuleForkDoneHandler = ::std::option::Option<
    unsafe extern "C" fn(
        exitcode: ::std::os::raw::c_int,
        bysignal: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleScanCB = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        keyname: *mut RedisModuleString,
        key: *mut RedisModuleKey,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleScanKeyCB = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut RedisModuleKey,
        field: *mut RedisModuleString,
        value: *mut RedisModuleString,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleConfigGetStringFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> *mut RedisModuleString,
>;
pub type RedisModuleConfigGetNumericFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_longlong,
>;
pub type RedisModuleConfigGetBoolFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigGetEnumFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetStringFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: *mut RedisModuleString,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetNumericFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_longlong,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetBoolFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_int,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetEnumFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_int,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigApplyFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleOnUnblocked = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        reply: *mut RedisModuleCallReply,
        private_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleAuthCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        username: *mut RedisModuleString,
        password: *mut RedisModuleString,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleTypeMethods {
    pub version: u64,
    pub rdb_load: RedisModuleTypeLoadFunc,
    pub rdb_save: RedisModuleTypeSaveFunc,
    pub aof_rewrite: RedisModuleTypeRewriteFunc,
    pub mem_usage: RedisModuleTypeMemUsageFunc,
    pub digest: RedisModuleTypeDigestFunc,
    pub free: RedisModuleTypeFreeFunc,
    pub aux_load: RedisModuleTypeAuxLoadFunc,
    pub aux_save: RedisModuleTypeAuxSaveFunc,
    pub aux_save_triggers: ::std::os::raw::c_int,
    pub free_effort: RedisModuleTypeFreeEffortFunc,
    pub unlink: RedisModuleTypeUnlinkFunc,
    pub copy: RedisModuleTypeCopyFunc,
    pub defrag: RedisModuleTypeDefragFunc,
    pub mem_usage2: RedisModuleTypeMemUsageFunc2,
    pub free_effort2: RedisModuleTypeFreeEffortFunc2,
    pub unlink2: RedisModuleTypeUnlinkFunc2,
    pub copy2: RedisModuleTypeCopyFunc2,
    pub aux_save2: RedisModuleTypeAuxSaveFunc,
}
#[test]
fn bindgen_test_layout_RedisModuleTypeMethods() {
    const UNINIT: ::std::mem::MaybeUninit<RedisModuleTypeMethods> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RedisModuleTypeMethods>(),
        152usize,
        concat!("Size of: ", stringify!(RedisModuleTypeMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleTypeMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleTypeMethods))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdb_load) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(rdb_load)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdb_save) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(rdb_save)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aof_rewrite) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aof_rewrite)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_usage) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(mem_usage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).digest) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(digest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux_load) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_load)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux_save) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_save)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux_save_triggers) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_save_triggers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_effort) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(free_effort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unlink) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(unlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copy) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defrag) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(defrag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_usage2) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(mem_usage2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_effort2) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(free_effort2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unlink2) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(unlink2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copy2) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(copy2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux_save2) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_save2)
        )
    );
}
extern "C" {
    pub static mut RedisModule_Alloc:
        ::std::option::Option<unsafe extern "C" fn(bytes: usize) -> *mut ::std::os::raw::c_void>;
}
extern "C" {
    pub static mut RedisModule_TryAlloc:
        ::std::option::Option<unsafe extern "C" fn(bytes: usize) -> *mut ::std::os::raw::c_void>;
}
extern "C" {
    pub static mut RedisModule_Realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            bytes: usize,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
extern "C" {
    pub static mut RedisModule_Free:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>;
}
extern "C" {
    pub static mut RedisModule_Calloc: ::std::option::Option<
        unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
    >;
}
extern "C" {
